#Использовать asserts
#Использовать ".."

Перем Рефлектор;

&Тест
Процедура ТестПланФормируется() Экспорт

	// Дано

	МенеджерТестирования = МенеджерТестирования();

	// Когда

	ТестПлан = МенеджерТестирования.Обнаружить();

	// Тогда

	Ожидаем.Что(ТестПлан.Дети().Количество()).Равно(16);

#Область НаборБезКонструктора

	ИндексНабора = 0;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборБезКонструктора",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(1);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"ПростоТестВНабореБезКонструктора",
		"ПростоТестВНабореБезКонструктора",
		"НаборБезКонструктора.ПростоТестВНабореБезКонструктора",
		ОбъединитьПути(".", "tests", "fixtures", "НаборБезКонструктора.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область НаборВыключенный

	ИндексНабора = 1;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборВыключенный",
		Списки.ИзЭлементов(),
		0,
		1,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(1);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"ЯНеДолженБылВызваться",
		"ЯНеДолженБылВызваться",
		"НаборВыключенный.ЯНеДолженБылВызваться",
		ОбъединитьПути(".", "tests", "fixtures", "НаборВыключенный.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область СломанныйНабор

	ИндексНабора = 2;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"СломанныйНабор",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов("ПередВсеми"),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

#КонецОбласти

#Область НаборКомпанейский

	ИндексНабора = 3;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборКомпанейский",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(2);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"Первый",
		"Первый",
		"НаборКомпанейский.Первый",
		ОбъединитьПути(".", "tests", "fixtures", "НаборКомпанейский.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Тест,
		"Второй",
		"Второй",
		"НаборКомпанейский.Второй",
		ОбъединитьПути(".", "tests", "fixtures", "НаборКомпанейский.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область НаборОдиночка

	ИндексНабора = 4;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборОдиночка",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		),
		Истина
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(2);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"Первый",
		"Первый",
		"НаборОдиночка.Первый",
		ОбъединитьПути(".", "tests", "fixtures", "НаборОдиночка.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Тест,
		"Второй",
		"Второй",
		"НаборОдиночка.Второй",
		ОбъединитьПути(".", "tests", "fixtures", "НаборОдиночка.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область НаборПадающий

	ИндексНабора = 5;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборПадающий",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов("ПередВсеми"),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов("ПослеВсех"),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			СтрШаблон("ЯПроигнорирован%1", Сч),
			СтрШаблон("ЯПроигнорирован%1", Сч),
			СтрШаблон("НаборПадающий.ЯПроигнорирован%1", Сч),
			ОбъединитьПути(".", "tests", "fixtures", "НаборПадающий.os"),
			0,
			Списки.ИзЭлементов(),
			Списки.ИзЭлементов(),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область НаборСВыключеннымиТестами

	ИндексНабора = 6;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборСВыключеннымиТестами",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(13);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"Выключен",
		"Выключен",
		"НаборСВыключеннымиТестами.Выключен",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Тест,
		"ВыключенЕслиИстина",
		"ВыключенЕслиИстина",
		"НаборСВыключеннымиТестами.ВыключенЕслиИстина",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2),
		ТипыОпределенийТестов.Тест,
		"ВыключенНаОСWindows",
		"ВыключенНаОСWindows",
		"НаборСВыключеннымиТестами.ВыключенНаОСWindows",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(3),
		ТипыОпределенийТестов.Тест,
		"ВыключенНаОСLinux",
		"ВыключенНаОСLinux",
		"НаборСВыключеннымиТестами.ВыключенНаОСLinux",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(4),
		ТипыОпределенийТестов.Тест,
		"ВыключенНаОСMacOS",
		"ВыключенНаОСMacOS",
		"НаборСВыключеннымиТестами.ВыключенНаОСMacOS",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(5),
		ТипыОпределенийТестов.Тест,
		"ВыключенДляOneScriptМладшеДвойки",
		"ВыключенДляOneScriptМладшеДвойки",
		"НаборСВыключеннымиТестами.ВыключенДляOneScriptМладшеДвойки",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(6),
		ТипыОпределенийТестов.Тест,
		"ВыключенДляOneScriptСтаршеДвойки",
		"ВыключенДляOneScriptСтаршеДвойки",
		"НаборСВыключеннымиТестами.ВыключенДляOneScriptСтаршеДвойки",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(7),
		ТипыОпределенийТестов.Тест,
		"ВключенЕсли",
		"ВключенЕсли",
		"НаборСВыключеннымиТестами.ВключенЕсли",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(8),
		ТипыОпределенийТестов.Тест,
		"ВключенНаОСWindows",
		"ВключенНаОСWindows",
		"НаборСВыключеннымиТестами.ВключенНаОСWindows",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(9),
		ТипыОпределенийТестов.Тест,
		"ВключенНаОСLinux",
		"ВключенНаОСLinux",
		"НаборСВыключеннымиТестами.ВключенНаОСLinux",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(10),
		ТипыОпределенийТестов.Тест,
		"ВключенНаОСMacOS",
		"ВключенНаОСMacOS",
		"НаборСВыключеннымиТестами.ВключенНаОСMacOS",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(11),
		ТипыОпределенийТестов.Тест,
		"ВключенДляOneScriptМладшеДвойки",
		"ВключенДляOneScriptМладшеДвойки",
		"НаборСВыключеннымиТестами.ВключенДляOneScriptМладшеДвойки",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(12),
		ТипыОпределенийТестов.Тест,
		"ВключенДляOneScriptСтаршеДвойки",
		"ВключенДляOneScriptСтаршеДвойки",
		"НаборСВыключеннымиТестами.ВключенДляOneScriptСтаршеДвойки",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСВыключеннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		1
	);

#КонецОбласти

#Область ПараметризованныйТест

	ИндексНабора = 7;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"ПараметризованныйТест",
		Списки.ИзЭлементов("Параметризованный"),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(
				"ПроверитьЧтоВсеЗначенияСистемногоПеречисленияПрошли",
				"ПроверитьЧтоВсеЗначенияПользовательскогоПеречисленияПрошли"
			),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(7);

#Область ИсточникЗначение

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Контейнер,
		"ИсточникЗначение",
		"ИсточникЗначение",
		"ПараметризованныйТест.ИсточникЗначение",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ИсточникЗначение",
			СтрШаблон("[%1, %2]", Сч * 2 - 1, Сч * 2),
			СтрШаблон("ПараметризованныйТест.ИсточникЗначение.[%1, %2]", Сч * 2 - 1, Сч * 2),
			ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
			0,
			Списки.ИзЭлементов(Сч * 2 - 1, Сч * 2),
			Списки.ИзЭлементов("Параметризованный"),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область ИсточникНеопределено

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Контейнер,
		"ИсточникНеопределено",
		"ИсточникНеопределено",
		"ПараметризованныйТест.ИсточникНеопределено",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1).Дети()).ИмеетДлину(1);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"ИсточникНеопределено",
		"[, ]",
		"ПараметризованныйТест.ИсточникНеопределено.[, ]",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(Неопределено , Неопределено),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

#КонецОбласти

#Область ИсточникJSONЗначение

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2),
		ТипыОпределенийТестов.Контейнер,
		"ИсточникJSONЗначение",
		"ИсточникJSONЗначение",
		"ПараметризованныйТест.ИсточникJSONЗначение",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ИсточникJSONЗначение",
			СтрШаблон("[%1, %2]", Сч * 2 - 1, Сч * 2),
			СтрШаблон("ПараметризованныйТест.ИсточникJSONЗначение.[%1, %2]", Сч * 2 - 1, Сч * 2),
			ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
			0,
			Списки.ИзЭлементов(Сч * 2 - 1, Сч * 2),
			Списки.ИзЭлементов("Параметризованный"),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область ИсточникJSONФайл

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(3),
		ТипыОпределенийТестов.Контейнер,
		"ИсточникJSONФайл",
		"ИсточникJSONФайл",
		"ПараметризованныйТест.ИсточникJSONФайл",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(3).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(3).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ИсточникJSONФайл",
			СтрШаблон("[%1, %2]", Сч * 2 - 1, Сч * 2),
			СтрШаблон("ПараметризованныйТест.ИсточникJSONФайл.[%1, %2]", Сч * 2 - 1, Сч * 2),
			ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
			0,
			Списки.ИзЭлементов(Сч * 2 - 1, Сч * 2),
			Списки.ИзЭлементов("Параметризованный"),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область ИсточникПеречислениеСистемное

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(4),
		ТипыОпределенийТестов.Контейнер,
		"ИсточникПеречислениеСистемное",
		"ИсточникПеречислениеСистемное",
		"ПараметризованныйТест.ИсточникПеречислениеСистемное",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(4).Дети()).ИмеетДлину(6);

	Сч = 0;

	Для Каждого Статус Из СтатусСообщения Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(4).Дети().Получить(Сч),
			ТипыОпределенийТестов.Тест,
			"ИсточникПеречислениеСистемное",
			СтрШаблон("[%1]", Статус),
			"ПараметризованныйТест.ИсточникПеречислениеСистемное." + СтрШаблон("[%1]", Статус),
			ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
			0,
			Списки.ИзЭлементов(Статус),
			Списки.ИзЭлементов("Параметризованный"),
			0
		);

		Сч = Сч + 1;

	КонецЦикла;

#КонецОбласти

#Область ИсточникПеречислениеПользовательское

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(5),
		ТипыОпределенийТестов.Контейнер,
		"ИсточникПеречислениеПользовательское",
		"ИсточникПеречислениеПользовательское",
		"ПараметризованныйТест.ИсточникПеречислениеПользовательское",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(5).Дети()).ИмеетДлину(5);

	Сч = 0;

	Для каждого Свойство Из Рефлектор.ПолучитьТаблицуСвойств(СостоянияВыполненияТестов) Цикл

		Значение = Рефлектор.ПолучитьСвойство(СостоянияВыполненияТестов, Свойство.Имя);

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(5).Дети().Получить(Сч),
			ТипыОпределенийТестов.Тест,
			"ИсточникПеречислениеПользовательское",
			СтрШаблон("[%1]", Значение),
			СтрШаблон("ПараметризованныйТест.ИсточникПеречислениеПользовательское.[%1]", Значение),
			ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
			0,
			Списки.ИзЭлементов(Значение),
			Списки.ИзЭлементов("Параметризованный"),
			0
		);

		Сч = Сч + 1;

	КонецЦикла;

#КонецОбласти

#Область ИсточникВыражение

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(6),
		ТипыОпределенийТестов.Контейнер,
		"ИсточникВыражение",
		"ИсточникВыражение",
		"ПараметризованныйТест.ИсточникВыражение",
		ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Параметризованный"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(6).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(6).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ИсточникВыражение",
			СтрШаблон("[%1, %2]", Сч * 2 - 1, Сч * 2),
			СтрШаблон("ПараметризованныйТест.ИсточникВыражение.[%1, %2]", Сч * 2 - 1, Сч * 2),
			ОбъединитьПути(".", "tests", "fixtures", "ПараметризованныйТест.os"),
			0,
			Списки.ИзЭлементов(Сч * 2 - 1, Сч * 2),
			Списки.ИзЭлементов("Параметризованный"),
			0
		);

	КонецЦикла;

#КонецОбласти

#КонецОбласти

#Область ПовторяемыйТест

	ИндексНабора = 8;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"ПовторяемыйТест",
		Списки.ИзЭлементов("Повторяемый"),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов("ПередКаждым"),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов("ПослеКаждого")
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(3);

#Область ТриРаза

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Контейнер,
		"ТриРаза",
		"ТриРаза",
		"ПовторяемыйТест.ТриРаза",
		ОбъединитьПути(".", "tests", "fixtures", "ПовторяемыйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Повторяемый"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ТриРаза",
			СтрШаблон("Повторение %1 из 3", Сч),
			СтрШаблон("ПовторяемыйТест.ТриРаза.Повторение %1 из 3", Сч),
			ОбъединитьПути(".", "tests", "fixtures", "ПовторяемыйТест.os"),
			0,
			Списки.ИзЭлементов(),
			Списки.ИзЭлементов("Повторяемый"),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область ТриРазаИменной

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Контейнер,
		"ТриРазаИменной",
		"ТриРазаИменной",
		"ПовторяемыйТест.ТриРазаИменной",
		ОбъединитьПути(".", "tests", "fixtures", "ПовторяемыйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Повторяемый"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ТриРазаИменной",
			СтрШаблон("ТриРазаИменной №%1", Сч),
			СтрШаблон("ПовторяемыйТест.ТриРазаИменной.ТриРазаИменной №%1", Сч),
			ОбъединитьПути(".", "tests", "fixtures", "ПовторяемыйТест.os"),
			0,
			Списки.ИзЭлементов(),
			Списки.ИзЭлементов("Повторяемый"),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область ТриРазаИменнойИменованный

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2),
		ТипыОпределенийТестов.Контейнер,
		"ТриРазаИменнойИменованный",
		"Я именованный",
		"ПовторяемыйТест.Я именованный",
		ОбъединитьПути(".", "tests", "fixtures", "ПовторяемыйТест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов("Повторяемый", "ОтображаемоеИмя"),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ТриРазаИменнойИменованный",
			СтрШаблон("Я именованный №%1", Сч),
			СтрШаблон("ПовторяемыйТест.Я именованный.Я именованный №%1", Сч),
			ОбъединитьПути(".", "tests", "fixtures", "ПовторяемыйТест.os"),
			0,
			Списки.ИзЭлементов(),
			Списки.ИзЭлементов("Повторяемый", "ОтображаемоеИмя"),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область Тест

	ИндексНабора = 9;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"Тест",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(2);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"Тест1",
		"Тест1",
		"Тест.Тест1",
		ОбъединитьПути(".", "tests", "fixtures", "Тест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Тест,
		"Тест2",
		"Я тест 2",
		"Тест.Я тест 2",
		ОбъединитьПути(".", "tests", "fixtures", "Тест.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область НаборПрерванный

	ИндексНабора = 10;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборПрерванный",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов("Прерваться"),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(1);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"НеДолженВыполнятьВПрерванномНаборе",
		"НеДолженВыполнятьВПрерванномНаборе",
		"НаборПрерванный.НеДолженВыполнятьВПрерванномНаборе",
		ОбъединитьПути(".", "tests", "fixtures", "НаборПрерванный.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область НаборСПрерваннымиТестами

	ИндексНабора = 11;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборСПрерваннымиТестами",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		),
		Истина
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(3);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"ПрерванныйТест",
		"ПрерванныйТест",
		"НаборСПрерваннымиТестами.ПрерванныйТест",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСПрерваннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Контейнер,
		"ПрерванныйТестПовторяемый",
		"ПрерванныйТестПовторяемый",
		"НаборСПрерваннымиТестами.ПрерванныйТестПовторяемый",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСПрерваннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1).Дети()).ИмеетДлину(4);

	Для Сч = 1 По 4 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ПрерванныйТестПовторяемый",
			СтрШаблон("Повторение %1 из 4", Сч),
			СтрШаблон("НаборСПрерваннымиТестами.ПрерванныйТестПовторяемый.Повторение %1 из 4", Сч),
			ОбъединитьПути(".", "tests", "fixtures", "НаборСПрерваннымиТестами.os"),
			0,
			Списки.ИзЭлементов(),
			Списки.ИзЭлементов(),
			0
		);

	КонецЦикла;

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2),
		ТипыОпределенийТестов.Контейнер,
		"ПрерванныйТестПараметризованный",
		"ПрерванныйТестПараметризованный",
		"НаборСПрерваннымиТестами.ПрерванныйТестПараметризованный",
		ОбъединитьПути(".", "tests", "fixtures", "НаборСПрерваннымиТестами.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2).Дети()).ИмеетДлину(4);

	Для Сч = 1 По 4 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(2).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			"ПрерванныйТестПараметризованный",
			СтрШаблон("[%1]", Сч),
			СтрШаблон("НаборСПрерваннымиТестами.ПрерванныйТестПараметризованный.[%1]", Сч),
			ОбъединитьПути(".", "tests", "fixtures", "НаборСПрерваннымиТестами.os"),
			0,
			Списки.ИзЭлементов(Сч),
			Списки.ИзЭлементов(),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область НаборПадающийВКонструкторе

	ИндексНабора = 12;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборПадающийВКонструкторе",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		),
		Истина,
		Ложь
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(3);

	Для Сч = 1 По 3 Цикл

		ПроверитьТест(
			ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(Сч - 1),
			ТипыОпределенийТестов.Тест,
			СтрШаблон("ЯПроигнорирован%1", Сч),
			СтрШаблон("ЯПроигнорирован%1", Сч),
			СтрШаблон("НаборПадающийВКонструкторе.ЯПроигнорирован%1", Сч),
			ОбъединитьПути(".", "tests", "fixtures", "НаборПадающийВКонструкторе.os"),
			0,
			Списки.ИзЭлементов(),
			Списки.ИзЭлементов(),
			0
		);

	КонецЦикла;

#КонецОбласти

#Область НаборКрасныхТестов

	ИндексНабора = 13;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборКрасныхТестов",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(2);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"СостояниеОшибка",
		"СостояниеОшибка",
		"НаборКрасныхТестов.СостояниеОшибка",
		ОбъединитьПути(".", "tests", "fixtures", "НаборКрасныхТестов.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(1),
		ТипыОпределенийТестов.Тест,
		"СостояниеСломан",
		"СостояниеСломан",
		"НаборКрасныхТестов.СостояниеСломан",
		ОбъединитьПути(".", "tests", "fixtures", "НаборКрасныхТестов.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область __Тест_Набор_Со_Странным_Именем_1_

	ИндексНабора = 14;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"__Тест_Набор_Со_Странным_Именем_1_",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		),
		,
		,
		"1_Тест-Набор.Со+Странным^Именем_1,"
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(1);

	ПроверитьТест(
		ТестПлан.Дети().Получить(ИндексНабора).Дети().Получить(0),
		ТипыОпределенийТестов.Тест,
		"Тест",
		"Тест",
		"__Тест_Набор_Со_Странным_Именем_1_.Тест",
		ОбъединитьПути(".", "tests", "fixtures", "1_Тест-Набор.Со+Странным^Именем_1,.os"),
		0,
		Списки.ИзЭлементов(),
		Списки.ИзЭлементов(),
		0
	);

#КонецОбласти

#Область НаборБезТестов

	ИндексНабора = 15;

	ПроверитьТестНабор(
		ТестПлан.Дети().Получить(ИндексНабора),
		"НаборБезТестов",
		Списки.ИзЭлементов(),
		0,
		0,
		Карты.ИзЭлементов(
			"ПередВсеми", Списки.ИзЭлементов(),
			"ПередКаждым", Списки.ИзЭлементов(),
			"ПослеВсех", Списки.ИзЭлементов(),
			"ПослеКаждого", Списки.ИзЭлементов()
		)
	);

	Ожидаем.Что(ТестПлан.Дети().Получить(ИндексНабора).Дети()).ИмеетДлину(0);

#КонецОбласти

#КонецОбласти

КонецПроцедуры

Процедура ПроверитьТестНабор(ТестНабор, Имя, Теги, Таймаут, Условия, ЖизненныйЦикл,
	ЭтоОдиночка = Ложь, ПроверятьТестНабор = Истина, ИмяФайла = "")

	Если ПустаяСтрока(ИмяФайла) Тогда
		ИмяФайла = Имя;
	КонецЕсли;

	Путь = ОбъединитьПути(".", "tests", "fixtures", ИмяФайла + ".os");

	Ожидаем.Что(ТестНабор).ИмеетТип("ОпределениеТестНабора");

	Ожидаем.Что(ТестНабор.Имя()).Равно(Имя);
	Ожидаем.Что(ТестНабор.ПолноеИмя()).Равно(Имя);
	Ожидаем.Что(ТестНабор.Путь()).Равно(Путь);
	Ожидаем.Что(Строка(ТестНабор)).Равно(Имя + " (" + Путь + ")");

	Если ПроверятьТестНабор Тогда
		Ожидаем.Что(ТестНабор.ТестНабор()).ИмеетТип("oneunit_testsuite_" + Имя);
	Иначе
		Ожидаем.Что(ТестНабор.ТестНабор()).ЭтоНеопределено();
	КонецЕсли;

	Если ЭтоОдиночка Тогда
		Ожидаем.Что(ТестНабор.ТестНабор()).Равно(ТестНабор.ТестНабор());
	Иначе
		Ожидаем.Что(ТестНабор.ТестНабор()).Не_().Равно(ТестНабор.ТестНабор());
	КонецЕсли;

	Ожидаем.Что(ТестНабор.Таймаут()).Равно(Таймаут);

	Ожидаем.Что(ТестНабор.Теги())
		.ИмеетТип("ФиксированныйСписок")
		.ИмеетДлину(Теги.Количество());

	Ожидаем.Что(ТестНабор.Теги().СодержитВсе(Теги)).Равно(Истина);

	Ожидаем.Что(ТестНабор.Условия())
		.ИмеетТип("ФиксированныйСписок")
		.ИмеетДлину(Условия);

	Для каждого МетодЖизненногоЦикла Из ЖизненныйЦикл.КлючиИЗначения() Цикл

		Результат = Рефлектор.ВызватьМетод(ТестНабор, МетодЖизненногоЦикла.Ключ);

		Ожидаем.Что(Результат)
			.ИмеетТип("ФиксированныйСписок")
			.ИмеетДлину(МетодЖизненногоЦикла.Значение.Количество());

		Ожидаем.Что(Результат.СодержитВсе(МетодЖизненногоЦикла.Значение)).Равно(Истина);

	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьТест(Тест, Тип, ИмяМетода, Имя, ПолноеИмя, Путь, Таймаут, Параметры, Теги, Условия)

	Ожидаем.Что(Тест).ИмеетТип("ОпределениеТеста");
	Ожидаем.Что(Тест.ТипОпределения()).Равно(Тип);
	Ожидаем.Что(Тест.ИмяМетода()).Равно(ИмяМетода);
	Ожидаем.Что(Тест.Имя()).Равно(Имя);
	Ожидаем.Что(Тест.ПолноеИмя()).Равно(ПолноеИмя);
	Ожидаем.Что(Тест.Путь()).Равно(Путь);
	Ожидаем.Что(Тест.Таймаут()).Равно(Таймаут);

	Ожидаем.Что(Тест.Параметры())
		.ИмеетТип("ФиксированныйСписок")
		.ИмеетДлину(Параметры.Количество());

	Ожидаем.Что(Тест.Параметры().СодержитВсе(Параметры)).Равно(Истина);

	Ожидаем.Что(Тест.Теги())
		.ИмеетТип("ФиксированныйСписок")
		.ИмеетДлину(Теги.Количество());

	Ожидаем.Что(Тест.Теги().СодержитВсе(Теги)).Равно(Истина);

	Ожидаем.Что(Тест.Условия())
		.ИмеетТип("ФиксированныйСписок")
		.ИмеетДлину(Условия);

КонецПроцедуры

Функция МенеджерТестирования()

	Детальки = Новый Соответствие;
	Детальки.Вставить("OneUnit.КаталогиТестов", "./tests/fixtures");

	Поделка = Новый Поделка(Новый СоветДругогоМастера().ЗначенияДеталек(Детальки));
	Поделка.ЗапуститьПриложение();
	Возврат Поделка.НайтиЖелудь("МенеджерТестирования");

КонецФункции

Рефлектор = Новый Рефлектор();
