#Использовать ".."

&ПараметризованныйТест
&ИсточникЗначение(Истина)
&ИсточникЗначение(Ложь)
Процедура ЧтоИстинно(Значение) Экспорт

	// Когда

	Попытка
		Предполагаем.ЧтоИстинно(Значение, "ЯИсключение");
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;

	// Тогда

	Если Значение Тогда

		Ожидаем.Что(ИнформацияОбОшибке)
			.ЭтоНеопределено();

	Иначе
		ПроверитьИсключение(ИнформацияОбОшибке);
	КонецЕсли;

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(Истина)
&ИсточникЗначение(Ложь)
Процедура ЧтоЛожно(Значение) Экспорт

	// Когда

	Попытка
		Предполагаем.ЧтоЛожно(Не Значение, "ЯИсключение");
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;

	// Тогда

	Если Значение Тогда

		Ожидаем.Что(ИнформацияОбОшибке)
			.ЭтоНеопределено();

	Иначе
		ПроверитьИсключение(ИнформацияОбОшибке);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьИсключение(ИнформацияОбОшибке)

	Ожидаем.Что(ИнформацияОбОшибке)
		.ИмеетТип(Тип("ИнформацияОбОшибке"));

	Ожидаем.Что(ИнформацияОбОшибке.Описание)
		.Равно("ЯИсключение");

	Ожидаем.Что(ИнформацияОбОшибке.Параметры)
		.ИмеетТип(Тип("ИсключениеТестПрерван"));

КонецПроцедуры
