#Использовать "../../support"

&ПередВсеми
Процедура ПередВсеми() Экспорт
	ЖурналВыполнения.Очистить();
	ЖурналВыполнения.Записать("ПередВсеми");
КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым() Экспорт
	ЖурналВыполнения.Записать("ПередКаждым");
КонецПроцедуры

&Тест
&Порядок(1)
Процедура Первый() Экспорт
	ЖурналВыполнения.Записать("Первый");
КонецПроцедуры

&Тест
&Порядок(2)
Процедура Второй() Экспорт
	ЖурналВыполнения.Записать("Второй");
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого() Экспорт
	ЖурналВыполнения.Записать("ПослеКаждого");
КонецПроцедуры

&ПослеВсех
Процедура ПослеВсех() Экспорт
	ЖурналВыполнения.Записать("ПослеВсех");
КонецПроцедуры
