#Использовать ".."

Перем Сч;

&Тест
Процедура ПрерванныйТест() Экспорт
	Предполагаем.ЧтоИстинно(Ложь, "Я прервался");
КонецПроцедуры

&ПовторяемыйТест(4)
Процедура ПрерванныйТестПовторяемый() Экспорт
	Сч = Сч + 1;
	Предполагаем.ЧтоИстинно(Сч <= 2, "Я прервался тоже по счётчику");
КонецПроцедуры

&ПараметризованныйТест
&ИсточникJSON("[ {""Значение"": 1}, {""Значение"": 2}, {""Значение"": 3}, {""Значение"": 4} ]")
Процедура ПрерванныйТестПараметризованный(Значение) Экспорт
	Предполагаем.ЧтоИстинно(Значение <= 2, "Я прервался тоже по значению параметра");
КонецПроцедуры

&ТестовыйНабор(Характер = "Одиночка")
&Порядок(10)
Процедура ПриСозданииОбъекта()
	Сч = 0;
КонецПроцедуры
